import java.util.*;
class Main12_12 {

    public static void main(String[] args) {

        /*
            - 2020 카카오 신입 공채

            죠르디는 주택 건축사업에 뛰어들기로 결심하였습니다. 죠르디는 기둥과 보를 이용하여 벽면 구조물을
            자동으로 세우는 로봇을 개발할 계획인데, 그에 앞서 로봇의 동작을 시뮬레이션 할 수 있는 프로그램을
            만들고 있습니다.
            프로그램은 2차원 가상 벽면에 기둥과 보를 이용한 구조물을 설치할 수 있는데, 기둥과 보는 길이가
            1인 선분으로 표현되며 다음과 같은 규칙을 가지고 있다.
            
            1. 기둥은 바닥 위에 있거나 보의 한쪽 끝부분 위에 있거나, 또는 다른 기둥 위에 있어야 합니다.
            2. 보는 한쪽 끝부분이 기둥 위에 있거나, 또는 양쪽 끝부분이 다른 보와 동시에 연결되어 있어야 합니다.

            단, 바닥은 벽면의 맨 아래 지면을 말합니다.
            2차원 벽면은 n x n 크기 정사각 격자 형태이며, 각 격자는 1x1 크기입니다. 맨 처음 벽면은 비어있는 상태입니다.
            기둥과 보는 격자 선의 교차점에 걸치지 않고, 격자 칸의 각 변에 정확히 일치하도록 설치할 수 있습니다.

            벽면의 크기 n, 기둥과 보를 설치하거나 삭제하는 작업이 순서대로 담긴 2차원 배열 build_frame이 매개변수로 
            주어질 때, 모든 명령어를 수행한 후 구조물의 상태를 return 하도록 solution 함수를 완성하라.
        */



    }
    
}
